package main
// Go语言教程: 第3章 运算符 - 算术运算符

import "fmt"

func main() {
	// 1、+ 运算符
	fmt.Println("10+3=", 10+3) // =13

	// 2、- 运算符
	fmt.Println("10-3=", 10-3) // =7

	// 3、* 运算符
	fmt.Println("10*3=", 10*3) // =30

	// 4、/ 运算符
	//除法注意：如果运算的数都是整数，那么除后，去掉小数部分，保留整数部分
	fmt.Println("10/3=", 10/3)     //3
	fmt.Println("10.0/3=", 10.0/3) //3.3333333333333335

	// 5、% 运算符
	// 取余注意 余数 = 被除数 -（被除数/除数）* 除数
	fmt.Println("10%3=", 10%3)     // =1
	fmt.Println("-10%3=", -10%3)   // -1
	fmt.Println("10%-3=", 10%-3)   // =1
	fmt.Println("-10%-3=", -10%-3) // =-1
}
